Can't make Extrusion.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotDrawExtrusionsError { get; }
  Visual Basic
Public Shared ReadOnly Property CannotDrawExtrusionsError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotDrawExtrusionsError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ExtrusionFailures Class
  Autodesk.Revit.DB Namespace